#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расчитать(Команда)
	
	ДниНедели = Новый Соответствие;
	ДниНедели.Вставить(1, "Понедельник");
	ДниНедели.Вставить(2, "Вторник");
	ДниНедели.Вставить(3, "Среда");
	ДниНедели.Вставить(4, "Четверг");
	ДниНедели.Вставить(5, "Пятница");
	ДниНедели.Вставить(6, "Суббота");
	ДниНедели.Вставить(7, "Воскресение");
	
	Множитель = 0;
				    
	Для Сч = 1 По 10 Цикл
		
		Год = КонецГода(ДобавитьМесяц(ТекущаяДата(), Множитель));
		
		ДеньНедели = ДеньНедели(КонецГода(Год));
		
		НоваяСтрока = ЭтаФорма.Таблица.Добавить();
		НоваяСтрока.Год = Год;
		НоваяСтрока.ДеньНедели = ДниНедели.Получить(ДеньНедели);
		
		Множитель = Множитель + 12;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти