#Область ПрограммныйИнтерфейс

Функция ПроверкаИНН(ИНН, ТипКонтрагента, ТекстОшибки = "") Экспорт
	
	ЮрЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если ТипКонтрагента = ЮрЛицо 
		И СтрДлина(ИНН) <> 10 Тогда
		
		ТекстОшибки = "Длина ИНН юридического лица должна быть 10 знаков!";
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТипКонтрагента = ЮрЛицо Тогда
		
		Для ЦифраИНН = 1 По 10 Цикл
			
			КодЦифрыИНН = Сред(ИНН, ЦифраИНН, 1); 
			КодЦифрыИНН = КодСимвола(КодЦифрыИНН);
			
			Если КодЦифрыИНН <48 Или КодЦифрыИНН >57 Тогда
				
				ТекстОшибки = "ИНН должен содержать только цифры!";
				Возврат Ложь;
				Прервать;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипКонтрагента = ФизЛицо
		И Стрдлина(ИНН) <> 12 Тогда
		
		ТекстОшибки = "Длина ИНН физического лица должна быть 12 знаков!";
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТипКонтрагента = ФизЛицо Тогда
		
		Для ЦифраИНН = 1 По 12 Цикл
			
			КодЦифрыИНН = Сред(ИНН, ЦифраИНН, 1); 
			КодЦифрыИНН = КодСимвола(КодЦифрыИНН);
			
			Если КодЦифрыИНН <48 Или КодЦифрыИНН >57 Тогда
				
				ТекстОшибки = "ИНН должен содержать только цифры!";
				Возврат Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СтрДлина(ИНН) = 10 Тогда
		
		КонтрольнаяСумма = 0;
		
		КонтрольныйМножительИНН = Новый Массив(9);
		КонтрольныйМножительИНН[0] = 2;
		КонтрольныйМножительИНН[1] = 4;
		КонтрольныйМножительИНН[2] = 10;
		КонтрольныйМножительИНН[3] = 3;
		КонтрольныйМножительИНН[4] = 5;
		КонтрольныйМножительИНН[5] = 9;
		КонтрольныйМножительИНН[6] = 4;
		КонтрольныйМножительИНН[7] = 6;
		КонтрольныйМножительИНН[8] = 8;   
		
		Для ЦифраИНН = 1 по 9 Цикл
			
			КонтрольнаяСумма = КонтрольнаяСумма + Сред(ИНН, ЦифраИНН, 1) * КонтрольныйМножительИНН[ЦифраИНН-1];
			
		КонецЦикла;
		
		КонтрольныйРазряд = (КонтрольнаяСумма%11);
		
		Если КонтрольныйРазряд = Число(Сред(ИНН, 10, 1)) или КонтрольныйРазряд = 10 Тогда
			
			Возврат Истина
			
		Иначе
			
			ТекстОшибки = "Контрольная сумма ИНН не верна!"; 
			Возврат Ложь
			
		КонецЕсли;
		
	ИначеЕсли СтрДлина(ИНН) = 12 Тогда
		
		КонтрольнаяСумма11 = 0;
		КонтрольнаяСумма12 = 0;
		
		Для Н=1 По 11 Цикл
			
			Если Н = 1 Тогда
				Множитель11 = 7;
				Множитель12 = 3;
			ИначеЕсли Н = 2 Тогда
				Множитель11 = 2;
				Множитель12 = 7;
			ИначеЕсли Н = 3 Тогда
				Множитель11 = 4;
				Множитель12 = 2;
			ИначеЕсли Н = 4 Тогда
				Множитель11 = 10;
				Множитель12 = 4;
			ИначеЕсли Н = 5 Тогда
				Множитель11 = 3;
				Множитель12 = 10;
			ИначеЕсли Н = 6 Тогда
				Множитель11 = 5;
				Множитель12 = 3;
			ИначеЕсли Н = 7 Тогда
				Множитель11 = 9;
				Множитель12 = 5;
			ИначеЕсли Н = 8 Тогда
				Множитель11 = 4;
				Множитель12 = 9;
			ИначеЕсли Н = 9 Тогда
				Множитель11 = 6;
				Множитель12 = 4;
			ИначеЕсли Н = 10 Тогда
				Множитель11 = 8;
				Множитель12 = 6;
			ИначеЕсли Н = 11 Тогда
				Множитель11 = 0;
				Множитель12 = 8;
			КонецЕсли; 
			
			Цифра = Число(Сред(ИНН,Н,1));
			КонтрольнаяСумма11 = КонтрольнаяСумма11 + Цифра * Множитель11;
			КонтрольнаяСумма12 = КонтрольнаяСумма12 + Цифра * Множитель12;
			
		КонецЦикла; 
		
		КонтрольныйРазряд11 = (КонтрольнаяСумма11 %11) %10;
		КонтрольныйРазряд12 = (КонтрольнаяСумма12 %11) %10;
		
		Если КонтрольныйРазряд11 <> Число(Сред(ИНН,11,1)) ИЛИ КонтрольныйРазряд12 <> Число(Сред(ИНН,12,1)) Тогда
			
			ТекстОшибки = "Контрольная сумма ИНН не верна!";
			Возврат Ложь;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти