#Область ОписаниеПеременных

//ТекстОшибки, ТекстОшибкиИНН - переменные для хранения текстов соответствующих ощибок при проверке заполнения элементов формы.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Тип = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		Элементы.Наименование.Заголовок = "Ф.И.О";
		Элементы.КПП.Видимость = Ложь;
		Элементы.ПолноеНаименование.Видимость = Ложь;
		Элементы.ДатаРождения.Видимость = Истина;
		
	Иначе
		
		Элементы.Наименование.Заголовок = "Наименование";
		Элементы.КПП.Видимость = Истина;
		Элементы.ПолноеНаименование.Видимость = Истина;
		Элементы.ДатаРождения.Видимость = Ложь;
		
	КонецЕсли;	
	
	Если Объект.ЭтоБанк Тогда
		
		Элементы.Банк.Видимость = Ложь;
		
	Иначе
		
		Элементы.Банк.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.Тип = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		Элементы.Наименование.Заголовок = "Ф.И.О";
		Элементы.КПП.Видимость = Ложь;
		Элементы.ПолноеНаименование.Видимость = Ложь;
		Элементы.ДатаРождения.Видимость = Истина;
		
	Иначе
		
		Элементы.Наименование.Заголовок = "Наименование";
        Элементы.КПП.Видимость = Истина;
		Элементы.ПолноеНаименование.Видимость = Истина;
		Элементы.ДатаРождения.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Объект.ЭтоБанк Тогда
		
		Элементы.Банк.Видимость = Ложь;
		
	Иначе
		
		Элементы.Банк.Видимость = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Банк) Тогда
		
		Объект.КорреспондентскийСчет = Объект.Банк.КорреспондентскийСчет; 
		Объект.БИК = Объект.Банк.БИК;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЭтоФизЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо");
		
	Если Объект.ЭтоБанк = Истина И Объект.Тип = ЭтоФизЛицо Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Проверьте корректность выбора типа контрагента. Физ.лицо не может быть банком!";
		Сообщение.Сообщить();

		Отказ = Истина;
				
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ИНН) Тогда
		
		ТекстОшибкиИНН = "";
		
		Если ПроверкаИННКлиент.ПроверкаИНН(Объект.ИНН, Объект.Тип, ТекстОшибкиИНН) = Ложь Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибкиИНН;
			Сообщение.Поле = "ИНН";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Объект.ЭтоБанк Тогда
		
		ПроверкаЗаполненияБанк();
		
	КонецЕсли;
	
	Если Объект.ЭтоБанк = Истина Тогда
		
		ТекстОшибкиБанк = "";
		Поле = "";
		
		Если ПроверкаРеквизитовБанкаКлиент.ПроверкаРеквизитовБанка(Объект.КорреспондентскийСчет, Объект.БИК, ТекстОшибкиБанк, Поле) = Ложь Тогда  
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибкиБанк;
			Сообщение.Поле = Поле;
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭтоБанкПриИзменении(Элемент)
	
	Если Объект.ЭтоБанк Тогда
		
		Элементы.Банк.Видимость = Ложь;
				
	Иначе
		
		Элементы.Банк.Видимость = Истина;
		Элементы.КорреспондентскийСчет.ТолькоПросмотр = Истина;
		Элементы.БИК.ТолькоПросмотр = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		
		Элементы.Наименование.Заголовок = "Ф.И.О";
		Элементы.КПП.Видимость = Ложь;
		Элементы.ПолноеНаименование.Видимость = Ложь;
		Элементы.ДатаРождения.Видимость = Истина;
		
	Иначе
		
		Элементы.Наименование.Заголовок = "Наименование";
		Элементы.КПП.Видимость = Истина;
		Элементы.ПолноеНаименование.Видимость = Истина;
		Элементы.ДатаРождения.Видимость = Ложь;
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	ТекстОшибки = "";
	
	Если  ПроверкаИННКлиент.ПроверкаИНН(Объект.ИНН, Объект.Тип, ТекстОшибки) = Ложь Тогда
		
		Элементы.ИНН.ЦветТекста = WebЦвета.Красный;
		Отказ = Истина;
		
	Иначе 
		
		Элементы.ИНН.ЦветТекста = WebЦвета.Черный;	
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура БанкОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	БанкОбработкаВыбораНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаКлиенте
Процедура БанкОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.КорреспондентскийСчет = "";
	Объект.БИК = "";
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.ПолноеНаименование = Объект.Наименование;
	
КонецПроцедуры
 
#КонецОбласти

 #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаЗаполненияБанк()
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) И Не ЗначениеЗаполнено(Объект.Банк) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "При указании р/с, укажите банк!";
		Сообщение.Поле = "Банк";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура БанкОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	Если Не ВыбранноеЗначение.ЭтоБанк Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите контрагента с атрибутом Банк.";
		Сообщение.Поле = "Банк";
		Сообщение.Сообщить();
		
	ИначеЕсли ВыбранноеЗначение.ЭтоБанк Тогда
		
		Объект.КорреспондентскийСчет = ВыбранноеЗначение.КорреспондентскийСчет;
		Объект.БИК = ВыбранноеЗначение.БИК;
		
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти





