#Область СлужебныеПроцедурыИФункции
 
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ПоступлениеТоваров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Дата,
	|	ПоступлениеТоваров.Комментарий,
	|	ПоступлениеТоваров.Контрагент,
	|	ПоступлениеТоваров.Номер,
	|	ПоступлениеТоваров.Ответственный,
	|	ПоступлениеТоваров.Сумма,
	|	ПоступлениеТоваров.Позиции.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		СтавкаНДС,
	|		Цена,
	|		Сумма,
	|		СуммаНДС
	|	)
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПозицииШапка = Макет.ПолучитьОбласть("ПозицииШапка");
	ОбластьПозиции = Макет.ПолучитьОбласть("Позиции");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если ВставлятьРазделительСтраниц Тогда
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПозицииШапка);
		ВыборкаПозиции = Выборка.Позиции.Выбрать();
		
		Пока ВыборкаПозиции.Следующий() Цикл
			
			ОбластьПозиции.Параметры.Заполнить(ВыборкаПозиции);
			ТабДок.Вывести(ОбластьПозиции, ВыборкаПозиции.Уровень());
			
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

