#Область СлужебныеПроцедурыИФункции

Процедура Печать(ТабДок, Ссылка) Экспорт
		
	Макет = Документы.ЗаказПоставщику.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Адрес,
	|	ЗаказПоставщику.Дата,
	|	ЗаказПоставщику.ДатаПоставки,
	|	ЗаказПоставщику.Комментарий,
	|	ЗаказПоставщику.Контрагент,
	|	ЗаказПоставщику.Номер,
	|	ЗаказПоставщику.Ответственный,
	|	ЗаказПоставщику.Позиции.(
	|		НомерСтроки,
	|		Наименование,
	|		Количество,
	|		СтавкаНДС,
	|		Цена,
	|		Сумма,
	|		СуммаНДС
	|	)
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПозицииШапка = Макет.ПолучитьОбласть("ПозицииШапка");
	ОбластьПозиции = Макет.ПолучитьОбласть("Позиции");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если ВставлятьРазделительСтраниц Тогда
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПозицииШапка);
		ВыборкаПозиции = Выборка.Позиции.Выбрать();
		
		Пока ВыборкаПозиции.Следующий() Цикл
			
			ОбластьПозиции.Параметры.Заполнить(ВыборкаПозиции);
			ТабДок.Вывести(ОбластьПозиции, ВыборкаПозиции.Уровень());
			
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
