#Область ПрограммныйИнтерфейс

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ПараметрыСеанса.ВремяНачалаСеанса = ТекущаяДатаСеанса();
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	ТекущийСотрудник = Справочники.Сотрудники.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ТекущийПользователь.УникальныйИдентификатор);
	
	Если Не ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		
		НовыйСотрудник = Справочники.Сотрудники.СоздатьЭлемент();
		НовыйСотрудник.Наименование = ТекущийПользователь.ПолноеИмя;
		НовыйСотрудник.ИдентификаторПользователяИБ = ТекущийПользователь.УникальныйИдентификатор;
		НовыйСотрудник.Записать();
		
		ТекущийСотрудник = НовыйСотрудник.Ссылка;
		
	КонецЕсли;
	
	ПараметрыСеанса.СотрудникТекущегоПользователя = ТекущийСотрудник;
	
КонецПроцедуры

#КонецОбласти