#Область ПрограммныйИнтерфейс 

&НаКлиенте
Функция ПроверкаРеквизитовБанка(КорреспондентскийСчет, БИК, ТекстОшибки = "", Поле = "") Экспорт
	
	Если Не ЗначениеЗаполнено(КорреспондентскийСчет) И Не ЗначениеЗаполнено(БИК) Тогда
		
		ТекстОшибки = "Укажите корреспондентский счет и БИК!";
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КорреспондентскийСчет) Тогда
		
		ТекстОшибки = "Укажите корреспондентский счет!";
		Поле = "КорреспондентскийСчет";
		
		//В части развития системы добавить проверку на корректность ввода к/с
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если СтрДлина(КорреспондентскийСчет) <> 20 Тогда
		
		ТекстОшибки = "Корреспондентский счет должен состоять из 20 цифр!";
		Поле = "КорреспондентскийСчет";
		
		//В части развития системы добавить проверку на корректность ввода к/с
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(БИК) Тогда
		
		ТекстОшибки = "Укажите БИК!";
		Поле = "БИК";
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если СтрДлина(БИК) <> 9 Тогда
		
		ТекстОшибки = "БИК должен состоять из 9 цифр!";
		Поле = "БИК";
		
		//В развитии разработки системы добавить проверку правильности БИК
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

