#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ТекущийСотрудникСервер.СотрудникТекущегоПользователя();	
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = "УЦ";
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Согласовано = Ложь Тогда
		
		Отказ = Истина;
		Сообщить("Необходимо согласовать документ перед проведением!");
		
	КонецЕсли;
	
	Для Каждого Строка Из Цены Цикл
		
		ПовторяющиесяСтроки = Цены.НайтиСтроки(Новый Структура("Номенклатура", Строка.Номенклатура));
		
		Если ПовторяющиесяСтроки.Количество() > 1 Тогда
			
			Отказ = Истина;
			
			Сообщить(СтрШаблон("Имеются повторяющиеся позиции номенклатуры %1. Удалите!", Строка.Номенклатура));
			
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Цены
	Движения.Цены.Очистить();
	
	Движения.Цены.Записывать = Истина;

	Для Каждого ТекСтрокаЦены Из Цены Цикл
		
		Если ТекСтрокаЦены.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			
			СтавкаНДС = 0;
			
		ИначеЕсли ТекСтрокаЦены.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
			
			СтавкаНДС = 10;
			
		ИначеЕсли ТекСтрокаЦены.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
			
			СтавкаНДС = 20;
			
		КонецЕсли;

		СуммаНДС = Окр(ТекСтрокаЦены.ЦенаБезНДС * СтавкаНДС / 100, 2);
		
		Движение = Движения.Цены.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
		Движение.ЦенаБезНДС = ТекСтрокаЦены.ЦенаБезНДС;
		Движение.СтавкаНДС = ТекСтрокаЦены.СтавкаНДС;
		Движение.ЦенаСНДС = ТекСтрокаЦены.ЦенаБезНДС + СуммаНДС;
		Движение.СуммаНДС = СуммаНДС;
		Движение.Контрагент = Контрагент;
				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти