
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере(Объект.Диаграмма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ПриОткрытииНаСервере(Объект.Диаграмма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриОткрытииНаСервере(Диаграмма)

  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продажи.Период = НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ) КАК Период,
		|	Продажи.Ответственный КАК Ответственный,
		|	ПРЕДСТАВЛЕНИЕ(Продажи.Ответственный) КАК ОтветственныйПредставление,
		|	СУММА(Продажи.Сумма - Продажи.Себестоимость) КАК ВаловаяПрибыль
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|
		|СГРУППИРОВАТЬ ПО
		|	Продажи.Ответственный,
		|	Продажи.Период = НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|ИТОГИ
		|	СУММА(ВаловаяПрибыль)
		|ПО
		|	Ответственный";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.АвтоТранспонирование = Ложь;
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		Серия = Диаграмма.УстановитьСерию(ВыборкаНоменклатура.Ответственный);
		Серия.Текст = ВыборкаНоменклатура.ОтветственныйПредставление;
		Серия.Расшифровка = ВыборкаНоменклатура.Ответственный;
	
		ВыборкаОтветственный = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаОтветственный.Следующий() Цикл
			
			Точка = Диаграмма.УстановитьТочку(ВыборкаОтветственный.Ответственный);
			Точка.Текст = ВыборкаОтветственный.ОтветственныйПредставление;
			Точка.Расшифровка = ВыборкаОтветственный.Ответственный;
			Диаграмма.УстановитьЗначение(Точка, Серия, ВыборкаОтветственный.ВаловаяПрибыль);
	
			ВыборкаДетальныеЗаписи = ВыборкаОтветственный.Выбрать();
	
		КонецЦикла
		
	КонецЦикла;
	
	Диаграмма.АвтоТранспонирование = Истина;
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти