#Область СлужебныеПроцедурыИФункции 

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	ЗначениеКонстанты = Константы.ИспользоватьПромоНаСкидки.Получить();
		
	Если ЗначениеКонстанты = Истина Тогда
		
		НачальныйНомер = 1;
		
	Иначе 
		
		НачальныйНомер = 11;
		
	КонецЕсли;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	НомерПромо = ГСЧ.СлучайноеЧисло(НачальныйНомер, 17);
		
	Макет = Документы.РеализацияТоваров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваров.Дата КАК Дата,
	|	РеализацияТоваров.Номер КАК Номер,
	|	РеализацияТоваров.Позиции.(
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		Скидка КАК Скидка
	|	) КАК Позиции,
	|	РеквизитыОрганизации.Наименование КАК Наименование,
	|	РеквизитыОрганизации.ИНН КАК ИНН,
	|	РеквизитыОрганизации.Адрес КАК Адрес,
	|	РеквизитыОрганизации.Сайт КАК Сайт,
	|	РеквизитыОрганизации.Телефон КАК Телефон,
	|	Промо.ТекстПромо КАК ТекстПромо
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров,
	|	Справочник.РеквизитыОрганизации КАК РеквизитыОрганизации,
	|	РегистрСведений.Промо КАК Промо
	|ГДЕ
	|	РеализацияТоваров.Ссылка В(&Ссылка)
	|	И Промо.Номер = &НомерПромо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваров.Позиции.(
	|		СУММА(Сумма) КАК СуммаИтого,
	|		СУММА(СуммаНДС) КАК СуммаНДС,
	|		СУММА(СуммаСНДС) КАК ИтогоСНДС,
	|		СУММА(РеализацияТоваров.Позиции.Количество * РеализацияТоваров.Позиции.Цена - РеализацияТоваров.Позиции.Сумма) КАК СуммаСкидки
	|	) КАК Позиции
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("НомерПромо", НомерПромо);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка2 = РезультатЗапроса[1].Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПозицииШапка = Макет.ПолучитьОбласть("ПозицииШапка");
	ОбластьПозиции = Макет.ПолучитьОбласть("Позиции");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьСпасибо = Макет.ПолучитьОбласть("Спасибо"); 
	ОбластьСайт = Макет.ПолучитьОбласть("Сайт");
	ОбластьПромо = Макет.ПолучитьОбласть("Промо");
	ОбластьКартинка = Макет.ПолучитьОбласть("Картинка");
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл 
		
		Если ВставлятьРазделительСтраниц Тогда
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		//Область Заголовок
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);
				
		//Область Шапка
		ОбластьШапка.Параметры.Заполнить(Выборка);
        ТабДок.Вывести(ОбластьШапка, Выборка.Уровень());
				
		//Область ПозицииШапка
		ТабДок.Вывести(ОбластьПозицииШапка);
				
		//Область Позиции
		ВыборкаПозиции = Выборка.Позиции.Выбрать();
		
		Пока ВыборкаПозиции.Следующий() Цикл
			
			ОбластьПозиции.Параметры.Заполнить(ВыборкаПозиции);
			ТабДок.Вывести(ОбластьПозиции, ВыборкаПозиции.Уровень());
			
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина; 
		
		//Область Подвал		
		Пока Выборка2.Следующий() Цикл
			
			ВыборкаПодвал = Выборка2.Позиции.Выбрать();
			
			Пока ВыборкаПодвал.Следующий() Цикл
				
				ОбластьПодвал.Параметры.Заполнить(ВыборкаПодвал);
				
			КонецЦикла;
			
		КонецЦикла;

		ТабДок.Вывести(ОбластьПодвал);        	
		
		//Область Спасибо
		ТабДок.Вывести(ОбластьСпасибо);
				
		//Область Сайт 
		ОбластьСайт.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьСайт);
				
		//Область Промо
		ОбластьПромо.Параметры.Заполнить(Выборка);
        ТабДок.Вывести(ОбластьПромо);
        	
		//Область Картинка
		ТабДок.Вывести(ОбластьКартинка);
     					
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

