#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	
	Ответственный = ТекущийСотрудникСервер.СотрудникТекущегоПользователя();
 
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(Банк) Тогда
		
		КорреспондентскийСчет = Неопределено;
		БИК = Неопределено;
		
	КонецЕсли;
	
	Если Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо И Не ЗначениеЗаполнено(ИНН) Тогда //Добавить проверки на заполнение иных реквезитов
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните ИНН юр.лица";
		Сообщение.Поле = "ИНН";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Банк) И Не Банк.ЭтоБанк Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите контрагента с атрибутом Банк.";
		Сообщение.Поле = "Банк";
		Сообщение.Сообщить();
		
		Отказ = Истина
	
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти