#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьМассив(Команда)
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Число2 = ГСЧ.СлучайноеЧисло( , Объект.Число);
    
	Массив = Новый Массив;
	Массив.Добавить(Объект.Число);
	Массив.Добавить(Объект.Число + Число2);
	
	ЭлементМассива = 1;
	
	Для Каждого Элемент Из Массив Цикл
				
		Сообщить(СтрШаблон("Значение элемента №%1 Массива: %2", ЭлементМассива, Элемент));
		ЭлементМассива = ЭлементМассива + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти