#Область ОписаниеПеременных

  //ТекстОшибки, ТекстОшибкиИНН - переменные для хранения текстов соответствующих ощибок при проверке заполнения элементов формы.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.Тип = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		Элементы.КПП.Видимость = Ложь;
		
	Иначе
		
		Элементы.КПП.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекстОшибкиИНН = "";
	
	Если ПроверкаИННКлиент.ПроверкаИНН(Объект.ИНН, Объект.Тип, ТекстОшибкиИНН) = Ложь Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибкиИНН;
		Сообщение.Поле = "ИНН";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		
		Элементы.КПП.Видимость = Ложь;
		
	Иначе
		
		Элементы.КПП.Видимость = Истина;
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	ТекстОшибки = "";
	
	Если  ПроверкаИННКлиент.ПроверкаИНН(Объект.ИНН, Объект.Тип, ТекстОшибки) = Ложь Тогда
		
		Элементы.ИНН.ЦветТекста = WebЦвета.Красный;
		Отказ = Истина;
		
	Иначе 
		
		Элементы.ИНН.ЦветТекста = WebЦвета.Черный;	
		
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти




