#Область ПрограммныйИнтерфейс

Процедура АктуализироватьСтатусы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Ссылка КАК Ссылка,
		|	ЗаказПоставщику.ДатаПоставки КАК ДатаПоставки,
		|	ЗаказПоставщику.Статус КАК Статус
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	(ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЗаказаПоставщика.НаправленПоставщику)
		|			ИЛИ ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЗаказаПоставщика.Просрочен)
		|			ИЛИ ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЗаказаПоставщика.ЗавтраПоставка)
		|			ИЛИ ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЗаказаПоставщика.СегодняПоставка))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Статусы:
	НаправленПоставщику = Перечисления.СтатусЗаказаПоставщика.НаправленПоставщику;
	Просрочен = Перечисления.СтатусЗаказаПоставщика.Просрочен;
	ЗавтраПоставка = Перечисления.СтатусЗаказаПоставщика.ЗавтраПоставка;
	СегодняПоставка = Перечисления.СтатусЗаказаПоставщика.СегодняПоставка;
	
	//Даты:
	Сегодня = НачалоДня(ТекущаяДата());
	Завтра = Сегодня + 86400;
			
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ДатаПоставки = Сегодня Тогда
			
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Документ.Статус = СегодняПоставка;
			Документ.Записать();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 сегодня поставка!", ВыборкаДетальныеЗаписи.Ссылка);
			Сообщение.КлючДанных = ВыборкаДетальныеЗаписи.Ссылка;
			Сообщение.Сообщить();
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ДатаПоставки = Завтра Тогда 
			
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Документ.Статус = ЗавтраПоставка;
			Документ.Записать();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 завтра поставка!", ВыборкаДетальныеЗаписи.Ссылка);
			Сообщение.КлючДанных = ВыборкаДетальныеЗаписи.Ссылка;
			Сообщение.Сообщить();
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ДатаПоставки < Сегодня Тогда
			
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Документ.Статус = Просрочен;
			Документ.Записать();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 просрочен!", ВыборкаДетальныеЗаписи.Ссылка);
			Сообщение.КлючДанных = ВыборкаДетальныеЗаписи.Ссылка;
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

